In [1]:
import pandas as pd

In [4]:
pd.DataFrame([[1,2,3],[4,5,6]])

   0  1  2
0  1  2  3
1  4  5  6

In [5]:
pd.Series({"한국":"서울","중국":"베이징","일본":"도쿄"})

한국     서울
중국    베이징
일본     도쿄
dtype: object

In [6]:
pd.DataFrame({"a":[1,2],"b":[2,3],"c":[2,6]}, index=[1,2])

   a  b  c
1  1  2  2
2  2  3  6

In [8]:
pd.DataFrame([[1,2,3],[4,5,6]], index=[1,2], columns=["a","b","c"])

   a  b  c
1  1  2  3
2  4  5  6

In [12]:
pd.DataFrame({"한국":["서울","부산","제주"]}, index=[1,2,3])

   한국
1  서울
2  부산
3  제주